In [172]:
# Note: this file created per Module 4.4.3: load and Read CSV Files.
# https://courses.bootcampspot.com/courses/1225/pages/4-dot-4-3-load-and-read-csv-files?module_item_id=497361

# Add the Pandas dependency.
import pandas as pd

In [173]:
#In the next cell, declare two variables: 
# one assigned to the schools_complete.csv file and one assigned to the students_complete.csv file. 
# (These files are located in the Resources folder.) 

# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [174]:
# ^^^ Cell above: When we want to get the indirect path to a file, 
# we use os.path.join() 
# to load a file from somewhere in our directory.

# If you decide to use this approach, you will need to import the os module with your Pandas dependency using the following code: 

# Add the dependencies.
# import pandas as pd
# import os

# Then, use the os.path.join() method to connect to the CSV files: 

# Files to load
# school_data_to_load = os.path.join("Resources", "schools_complete.csv")
# student_data_to_load = os.path.join("Resources", "students_complete.csv")

In [175]:
# Read the School Data File
# Now we'll read each CSV file with the Pandas function read_csv(). 
# Inside this function, we'll add the file we want to read, 
# which is one of many parameters that we can add to this function.

# Next step (below):

# The code below  to a new cell and run the cell 
# will allow us to read schools_complete.csv and store it in a DataFrame.

# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [176]:
# Read the Student Data File
# Now we'll read the student data file and store it in a Pandas DataFrame by adding the following code to a new cell:

# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [177]:
# Per Module 4.4.4: Commit Your Code: Save PySchools.ipynb to
# School_District_Analysis folder (make sure the Resources folder containing
# the CSV files is also in the School_District_Analysis folder).

# Instructions on how to commit code in Module 4.4.4 (refer to the module).
# https://courses.bootcampspot.com/courses/1225/pages/4-dot-4-4-commit-your-code?module_item_id=497366

In [178]:
# Module 4.5.1: Find Missing Values.
# The count() Method
# With the count() method, we can get a count of the rows for each column containing data. By default, "null" values are not counted, so you can often quickly identify which columns have missing data.

# Let's use the count() method on the school_data_df DataFrame. Add the following code to a new cell and run the cell:

# Determine if there are any missing values in the school data.
# (Cell below): school_data_df.count()

In [179]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [180]:
# ^^^ (Cell above: no missing values.)
# Do the same with student_complete.csv (below)

In [181]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [182]:
# ^^^ (Cell above: no missing values.)

In [183]:
# The isnull() Method (applied to the cell below):
# The Pandas library also has the isnull() method for determining empty rows. When you apply the isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, either "True" for the row or rows that are empty, i.e., null, or "False" for the rows that are not empty.

# Let's use the isnull() method on the school_data_df DataFrame.

# Determine if there are any missing values in the school data.
# school_data_df.isnull()
# When we execute this code, we see that every row that is not empty is given the Boolean value "False," which tells us that there are no missing values.

In [184]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [185]:
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [186]:
# To get the total number of empty rows, or rows that are "True," we can use the Pandas sum() method after the isnull() method, like this:

# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [187]:
# ^^^ (Cell above): This output allows us to more easily determine at a glance how many rows are empty in the student_data_df DataFrame (zero). This is more straightforward than output that shows "False" in thousands of rows.

In [188]:
#The notnull() Method
#Another method that we can use to find missing values is the notnull() method. When you apply the notnull() method to a column, Series, or a DataFrame, a Boolean will be returned: "True" for the row or rows that are not empty, or "False" for the row or rows that are empty. This method returns the opposite output of the isnull() method.

# Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [189]:
# ^^^ (Cell above): When we run this code, the output returns a copy of our school_data_df DataFrame, where all the rows that do not have any missing values are labeled "True." See the following image.

In [190]:
#Like we did with the student_data_df DataFrame, we can chain the notnull() method and the sum() method to get the sum of all the columns that are "True."

# Determine if there are not any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [191]:
# ^^^ (Cell above): When we execute this code, we get the number of rows that are not null, which is 39,170 for each column.

In [192]:
# Module 4.5.3: Determine Data Types

# Data type: Boolean; Pandas name: bool; example: "True and False"
# Data type: Object; Pandas name: O, object; example: Typically strings; often used as a catchall for columns with different data types or other Python objects like tuples, lists, and dictionaries
# # Data type: datetime; Pandas name: datetime64; example: Specific moment in time with nanosecond precision, i.e., 2019-06-03 16:04:00.465107

# If integers store values from –32,768 to 32,767, they are 16 bits or int16.
# If integer store values from –2,147,483,648 to 2,147,483,647, they are 32 bits or int32.
# If integer store values from–9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, they are 64 bits, or int64. 

# With the Pandas library, we can check the data types of each column by using the Pandas dtypes attribute on a DataFrame.

# To determine the data types in school_data.csv, type and run the following code (refer to cell below):

In [193]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [194]:
school_data_df["budget"].dtype

dtype('int64')

In [195]:
# Module 4.5.7 (Fix the Students' Names): CODE NOT WORKING

# Add each prefix and suffix to remove to a list.
# CODE WORKS: prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
# CODE DOES NOT WORK: for word in prefixes_suffixes:
# CODE DOES NOT WORK: student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

# file was commited onto GitHub (with this cell of code commented out; commented out for future reference)

# Module 4.6.1: instructions to download clean_students_complete.csv and save into Resources folder

# Continued onto module 4.7.1 below:

In [196]:
# Module 4.7.1 (Merge DataFrames):

# To merge two DataFrames, there must be a column in each of the DataFrames with the same name. So before we merge, let's review the column names in each DataFrame.

# The columns in school_data_df are:
# School ID
# school_name
# type
# size
# budget

# The columns in the student_data_df are:
# Student ID
# student_name
# gender
# grade
# school_name
# reading_score
# math_score

# We'll merge school_data_df and student_data_dfon a shared column using the merge() method. The column that these DataFrames have in common is school_name. Inside the parentheses of the merge() method, we'll do the following:

# Add the DataFrames to be merged.
# Add the shared column to each DataFrame so that the merge can occur.
# Define how the DataFrames should be merged: left, right, inner, or outer. The default is inner. (You will learn more about merging later in this course.)

In [197]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

# Let's break down how the DataFrames are being merged with this code.

# We create a new DataFrame for the merged DataFrames, called school_data_complete_df.
# The new DataFrame is created as a result of merging DataFrame #2 (school_data_df), which is the "right" DataFrame, into DataFrame #1 (student_data_df), which is the "left" DataFrame. We refer to the DataFrames as "left" and "right" to reflect the order they appear inside the parentheses.
# We use the parameter "on," which is equal to a list of the columns that are identical from each DataFrame, in this case, "school_name." We can also use the column name like this: on="school_name".

# There may be cases in which you want to merge on a column that has similar information in two separate DataFrames, but is named differently in each—for example, "school_name" in one DataFrame and "high_school" in the second. In these cases, you should rename the columns so that they match. This will help avoid duplicate columns or merging issues.

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [198]:
# ^^^ (Cell above): The data from student_data_df takes up the first seven columns, and the four columns from the school_data_df are added at the end: School ID, type, size, and budget.

# Now that we have our merged DataFrame, we can start getting some of the school district's key metrics.

In [199]:
# Module 4.7.2: Get the Number of Students

# If we add the count() method to the school_data_complete_df DataFrame, we will count all the items in each row for each column that is not null.

# Get the total number of students.
# student_count = school_data_complete_df.count()
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [200]:
# In the output, we see that each column has 39,170 rows, or values. 
# Therefore, we can choose any one of the columns
# and get the student count using the following format: school_data_complete_df[column].count()--comment out 'student_count = school_data_complete_df.count()' in the previous cell.

In [201]:
# Module 4.7.3: Get the Number of Schools
    
# There are two ways we can get the number of schools. 
# One is to use the school_data_df DataFrame and assign a variable to one of the columns in the DataFrame, like this:

# Calculate the total number of schools.
school_count = school_data_df["school_name"].count()
school_count

15

In [202]:
# ^^^ (Cell above): After running the code, the output is 15.

# We can't use the count() method on the school_data_complete_df["school_name"] column because this would give us a value of 39,170. If we want to use school_data_complete_df, we first need to get the unique items in the ["school_name"] column by using the unique() method. This method will return a "ndarray", or n-dimensional array of all the unique values of that column.

# Add the following code to a new cell and run the cell. The output is shown below.

In [203]:
# Calculate the total number of schools
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [204]:
len(school_data_complete_df["school_name"].unique())

15

In [205]:
# Module 4.7.4: Get the Total Budget
    
# Calculate the total budget.
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [206]:
# Module 4.7.5: Get the Score Averages

# Calculate the average reading score.
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [207]:
# Calculate the average math score.
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [208]:
# Module 4.7.6: Get the Passing Percentages

# To get the percentage of students who passed math and reading, we will write code to:

# Determine the passing grade.
# Get the number of students who passed math and reading in separate DataFrames.
# Calculate the number of students who passed math and reading.
# Calculate the percentage of students who passed math and reading.
# To get the overall passing percentage, we will write code to:

# Get the number of students who passed both math and reading in a DataFrame.
# Calculate the number of students who passed both math and reading.
# Calculate the percentage of students who passed both math and reading.

In [209]:
# Determine the Passing Grade
# For math and reading assessment tests in this school district, the passing score was 70. Therefore, we need to get all the math and reading scores that are greater than or equal to 70. To do this, in a new cell, assign a passing_math variable to the math_score column in school_data_complete_df, where all the math scores are equal to or greater than 70.

passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70

In [210]:
# To find the passing_math variable, run passing_math in a new cell (below). 
# The result is Boolean values for the rows, where "True" means the score is 
# equal to or greater than 70, and "False" means the score is not equal to or greater than 70.

# When we execute the code for passing_reading, we will get Boolean values for each row, 
# where "True" means the score is equal to or greater than 70, and "False" means the score is not equal to or greater than 70.

In [211]:
# Get the Number of Students Who Passed Math and Reading
# To get all the students who passed math and all the students 
# who passed reading, we need to filter our school_data_complete_df DataFrame for the "True" cases. 
# In other words, get only the students who have a grade is equal or greater to 70.

# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [212]:
passing_math["student_name"].count()

29370

In [213]:
# Now we can repurpose the code we wrote to calculate passing_math in order to find passing_reading, 
# but we'll switch out math_score with reading_score, as shown in the following code:

# Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]

# To get the number of students who passed math and reading, apply the count() method to the student_name column of the passing_math and passing_reading DataFrames, like this:

# Calculate the number of students passing math.
passing_math_count = passing_math["student_name"].count()

# Calculate the number of students passing reading.
passing_reading_count = passing_reading["student_name"].count()

In [214]:
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [215]:
# Get the Percentage of Students Who Passed Math and Reading
# To get the percentage of students who passed math and reading, 
# divide the passing_math_count and the passing_reading_count by the total number of students, 
# and then multiply by 100.

# Since we are calculating a percentage, we need to convert the student_count to a number with a decimal, or floating-point decimal, by using float().

# The final calculation should look like this:

# Calculate the percent that passed math.
passing_math_percentage = passing_math_count / float(student_count) * 100

# Calculate the percent that passed reading.
passing_reading_percentage = passing_reading_count / float(student_count) * 100

In [216]:
# When we execute this cell and print out the passing_math_percentage and passing_reading_percentage, 
# we get the percentage of students who passed math and the percentage of students who passed reading:
print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [217]:
# Calculate the Overall Passing Percentage
# To get the overall passing percentage, we need to get all the students who passed both math and reading and divide by the total number of students.

# We can filter the school_data_complete_df DataFrame by adding the school_data_complete_df["math_score"] >= 70 and school_data_complete_df["reading_score"] >= 70 with the logical operator "&" within brackets, like this:

# When we run this cell (below), the output will be a new DataFrame with all the columns that contain students who passed both math and reading.

# Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [218]:
passing_math_reading["student_name"].count() # Option 1 of getting total number of students that passed math AND reading

25528

In [219]:
passing_math_reading.student_name.count() # Option 2 of getting total number of students that passsed math AND reading

25528

In [220]:
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [221]:
# Finally, we calculate the percentage of students who passed both math and reading by dividing the total number of students and multiplying by 100, using the following code.

# Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

In [222]:
# This completes the data we need for the district summary. Now we'll add it to a new DataFrame.

In [223]:
# Module 4.7.7: Create a District Summary DataFrame

# Now that we have performed all the calculations needed for the district summary, let's add the following values and columns to a new DataFrame named district_summary_df.

# Total number of schools in the column "Total Schools"
# Total number of students in the column "Total Students"
# Total budget in the column "Total Budget"
# Average reading score in the column "Average Reading Score"
# Average math score in the column "Average Math Score"
# Percentage of students passing reading in the column "% Passing Reading"
# Percentage of students passing math in the column "% Passing Math"
# Overall passing percentage in the column "% Overall Passing"

# REWIND: Remember, one way to create a new DataFrame is to convert a list of dictionaries to a DataFrame.

In [224]:
# To create district_summary_df DataFrame, we can create a list of dictionaries, where the keys are column names and the values are the metrics we calculated. We do this because the DataFrame has no index, and lists have natural indexing.

# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame(
          [{"Total Schools": school_count,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,
         "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": overall_passing_percentage}])
district_summary_df

# Per Module 4.7.8: place this code below the district_summary_df DataFrame

# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]

# # Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [225]:
# Module 4.7.8: Format Columns

# To clean up the district_summary_df DataFrame, we will format dollar amounts to two decimal places, and format the grade averages to one decimal place and percentages to the nearest whole number percent.

# This type of formatting can be done with the built-in Pandas map() function. The map() function is used for substituting each value in a Series with another value. Where the new value is generated from a function, a dictionary, or a Series.

# In this module, as well as future modules, we'll be using and writing functions. So before we use the map() function for formatting, let's gain a better understanding of how functions work.

In [226]:
# Define the function "say_hello" so it prints "Hello!" when called.
def say_hello():
    print("Hello!")
    

    
# Let's go over what is happening in this function.

# The def keyword, which is short for "define," and is used to create the function.
# The function name, say_hello(), is always written after def.
# There is a colon after the function name, which tells Python that a code block or statement will follow. This is similar to conditional and repetition statements. All code within the function should be indented.
# The indented statement that follows is print("Hello!").

In [227]:
# Calling a Function

# Now we'll practice calling a function. Create a new Jupyter Notebook file and name it function.ipynb. Copy the following code for the say_hello() function into the file.

# When you run the code (above), nothing appears to happen because we don't see an output error. To get the function to print "Hello!" in the output cell, we have to call the function.

# To call the say_hello() function, type say_hello() in a new cell and run the cell.

# Call the function.
say_hello()

Hello!

In [228]:
# Another example of calling a function:

# Define teh function "say_something" so it prints whatever is passed as the variable when called.
def say_something(something):\
    print(something)

In [229]:
# Call the function
say_something("Hello World")

Hello World

In [230]:
Jane_says = "Hi, my name is Jane. I'm learning Python!"
say_something(Jane_says)

Hi, my name is Jane. I'm learning Python!

In [231]:
# ---End of example (above) ---

In [232]:
# Writing Functions for the School District Data
# We've reviewed some basics about functions. Now how do we apply functions to our data analysis? For example, consider if you were in charge of calculating passing percentages for not just the school district we've been focusing on, but many school districts. It wouldn't be efficient to perform the steps of the calculation for each school district. A better method would be to create functions for this calculation and pass variables into the function.

# Let's say you need to write a function to get the percentage of students who passed math when we know the number of students that passed math, pass_math_count, and the total number of students for a school district, student_count. We can define this function as passing_math_percentand pass the two values inside the function. Here's what this might look like:

# Define a function that calculates the percentage of students that passed both 
# math and reading and returns the passing percentage when the function is called.

def passing_math_percent(pass_math_count, student_count):
    return pass_math_count / float(student_count) * 100

# Let's go over what is happening in this function.

# We added two values to the passing_math_percent function: pass_math_count and student_count.
# We added return in front of the calculation for the passing percentage.
# The return statement has a unique purpose. It causes the function to end and literally "returns" what is in front of the statement back to the caller, which is the function. Let's run through an example of what happens to better illustrate the process.

In [233]:
# In a new cell, assign the passing_math_count and the total_student_count variables 29,730 and 39,170, respectively. When we run this cell, that nothing will happen until we call the function.

passing_math_count = 29370
total_student_count = 39170

In [234]:
# Now we can call the function in a new cell with the two values, like this:

# IMPORTANT: If you don't add the number of parameters that are assigned to the function when calling the function, you'll get a TypeError:. This means that you need to add one or more of the parameters when calling the function.

# Call the function.
passing_math_percent(passing_math_count, total_student_count)

74.9808526933878

In [235]:
# ---More examples of functions inside functions.ipynb file (Module 4.7.8)---

In [236]:
# We can format the dollar amounts in the district_summary_df columns to two decimal places with a U.S. dollar sign, and numbers larger than 999 with a thousands separator.
# Let's apply this formatting technique to format the Total Students column with a thousands separator using the basic syntax:
# df["column"] = df["column"].map("{:,}".format)
# Now let's replace df["column"] with district_summary_df["Total Students"], so our code looks like the following. Add this code to youPyCitySchools.ipynb file below the output of your district_summary_df DataFrame, and run the cell.

In [237]:
# One benefit of using the format() function is that we can add other format specifications, like a U.S. dollar sign or other characters. For example, we will format the Total Budget column in the district_summary_df DataFrame with a U.S. dollar sign, and then format the numbers with a thousands separator and to two decimal places using the following syntax: "${:,.2f}".format.

In [238]:
# Per Module 4.7.8: add the following code to a new cell in our PyCitySchools.ipynb file and run the cell.

# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [239]:
# We need to format the remaining columns accordingly:

# The "Average Reading Score" column will be formatted to one decimal place.
# The "Average Math Score" column will be formatted to one decimal place.
# The "% Passing Reading" column will be formatted to the nearest whole number percentage.
# The "% Passing Math" column will be formatted to the nearest whole number percentage
# The "% Overall Passing" column will be formatted to the nearest whole number percentage.

In [240]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [241]:
# Module 4.7.9: Reorder Columns

# If the order of your columns in the district summary DataFrame is not in top-down order, you need to reorder them. If the columns are already in this order, you can use this time to gain familiarity with how to reorder columns in case the need arises. 

# The order of the columns in the district_summary_df DataFrame should be as follows:

# Total Schools
# Total Students
# Total Budget
# Average Math Score
# Average Reading Score
# % Passing Math
# % Passing Reading
# % Overall Passing

In [242]:
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
# You can change the order of the columns or delete any from the line of code above.

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65